tempfile=dialog.txt
dialog --yesno "Желаете продолжить?" 10 70
echo $?

dialog --title "Текстовое сообщение" --msgbox \
"Текст сообщения. Для подтверждения нажмите <OK>" 8 70

dialog --title "Поле для ввода" --inputbox \
"Введите текст. Полученый текст будет являться результат выполнения команды. При нажатии кнопки <Cancel> команда завершится со статусом 1" 15 70 \
"Текст по умолчанию в поле ввода" 2> $tempfile
echo $?

dialog --title "Текстовое сообщение" --msgbox \
"Введенный текст: \
$(cat $tempfile)" 10 70

dialog --title "Меню" --menu \
"В данном окне можно выбрать один из предложенных вариантов" 15 70 3 \
"Item 1" "Элемент 1" \
"Item 2" "Элемент 2" \
"Item 3" "Элемент 3" 2>$tempfile

dialog --title "Текстовое сообщение" --msgbox \
"Выбраный вариант: \
$(cat $tempfile)" 10 70

dialog --title "Меню со множественным выбором" --checklist \
"В даннои окне можно выбрать несколько из предложенных вариантов. Для выбора элемента используется кнопка <space>" 15 70 3 \
"a" "Элемент 1" "on" \
"b" "Элемент 2" "on" \
"c" "Элемент 3" "off" 2>$tempfile

dialog --title "Текстовое сообщение" --msgbox \
"Выбранные варианты: \
$(cat $tempfile)" 10 70

dialog --title "Список с выбором одного элемента" --radiolist \
"В данном окне можно выбрать только один вариант. С возможностью указать значение по умолчанию" 15 70 4 \
"First" "Элемент 1" "off" \
"Second" "Элемент 2" "off" \
"Third" "Элемент 3" "off" 2>$tempfile

dialog --title "Текстовое сообщение" --msgbox \
"Выбранные варианты: \
$(cat $tempfile)" 10 70

declare -i counter=1
{
    while test $counter -le 100
    do
    echo $counter
    counter=counter+1
    sleep 1
    done
} | dialog --title "Окно прогресса" --gauge \
"Данное окно позволяет показать прогресс работы скрипта." 10 70 0
